#### ✅ Terraform Format and Style 🖌
#### ✅ Terraform Initialization ⚙️
#### ✅ Terraform Validation 🤖
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### ✅ Terraform Plan 📖

<details><summary>Show Plan</summary>

```
random_password.certificate-password: Refreshing state... [id=none]
tls_private_key.private_key: Refreshing state... [id=e02215b4a26f6411d46c394957a920ba15244fd6]
acme_registration.reg: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/acct/1611596407]
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter]
azurerm_log_analytics_workspace.log-analytics-workspace: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.OperationalInsights/workspaces/log-otter-log-analytics-workspace]
azurerm_dns_zone.sample-domain: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.Network/dnsZones/sample.logotter.co.uk]
azurerm_cosmosdb_account.db: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.DocumentDB/databaseAccounts/log-otter-samples]
azurerm_container_app_environment.container-app-environment: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/managedEnvironments/log-otter-sample-container-app-environment]
azurerm_application_insights.app-insights: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.Insights/components/log-otter-app-insights]
azurerm_dns_a_record.api: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.Network/dnsZones/sample.logotter.co.uk/A/api]
azurerm_dns_a_record.admin: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.Network/dnsZones/sample.logotter.co.uk/A/admin]
azurerm_dns_a_record.root: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.Network/dnsZones/sample.logotter.co.uk/A/@]
azurerm_container_app.ingress: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/ingress]
azurerm_dns_txt_record.root: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.Network/dnsZones/sample.logotter.co.uk/TXT/asuid.www]
azurerm_dns_txt_record.admin: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.Network/dnsZones/sample.logotter.co.uk/TXT/asuid.admin]
azurerm_dns_txt_record.api: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.Network/dnsZones/sample.logotter.co.uk/TXT/asuid.api]
azurerm_container_app.customer-api: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/customer-api]
azurerm_container_app.customer-worker: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/customer-worker]
azurerm_container_app.hub: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/hub]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # acme_certificate.certificate will be created
  + resource "acme_certificate" "certificate" {
      + account_key_pem               = (sensitive value)
      + cert_timeout                  = 30
      + certificate_domain            = (known after apply)
      + certificate_not_after         = (known after apply)
      + certificate_p12               = (sensitive value)
      + certificate_p12_password      = (sensitive value)
      + certificate_pem               = (known after apply)
      + certificate_url               = (known after apply)
      + common_name                   = "sample.logotter.co.uk"
      + disable_complete_propagation  = false
      + id                            = (known after apply)
      + issuer_pem                    = (known after apply)
      + key_type                      = "2048"
      + min_days_remaining            = 30
      + must_staple                   = false
      + pre_check_delay               = 0
      + private_key_pem               = (sensitive value)
      + revoke_certificate_on_destroy = true
      + subject_alternative_names     = [
          + "*.sample.logotter.co.uk",
        ]

      + dns_challenge {
          + config   = (sensitive value)
          + provider = "azuredns"
        }
    }

  # azurerm_container_app.customer-api will be updated in-place
  ~ resource "azurerm_container_app" "customer-api" {
        id                            = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/customer-api"
        name                          = "customer-api"
        tags                          = {}
        # (8 unchanged attributes hidden)

      ~ template {
            # (2 unchanged attributes hidden)

          ~ container {
              ~ image             = "ghcr.io/logotter/customer-api:0.1.77" -> "ghcr.io/logotter/customer-api:"
                name              = "customer-api"
                # (5 unchanged attributes hidden)

                # (6 unchanged blocks hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_container_app.customer-worker will be updated in-place
  ~ resource "azurerm_container_app" "customer-worker" {
        id                            = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/customer-worker"
        name                          = "customer-worker"
        tags                          = {}
        # (7 unchanged attributes hidden)

      ~ template {
            # (2 unchanged attributes hidden)

          ~ container {
              ~ image             = "ghcr.io/logotter/customer-worker:0.1.77" -> "ghcr.io/logotter/customer-worker:"
                name              = "customer-worker"
                # (5 unchanged attributes hidden)

                # (4 unchanged blocks hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_container_app.hub will be updated in-place
  ~ resource "azurerm_container_app" "hub" {
        id                            = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/hub"
        name                          = "hub"
        tags                          = {}
        # (8 unchanged attributes hidden)

      ~ template {
            # (2 unchanged attributes hidden)

          ~ container {
              ~ image             = "ghcr.io/logotter/hub:0.1.77" -> "ghcr.io/logotter/hub:"
                name              = "hub"
                # (5 unchanged attributes hidden)

                # (6 unchanged blocks hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_container_app.ingress will be updated in-place
  ~ resource "azurerm_container_app" "ingress" {
        id                            = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/ingress"
        name                          = "ingress"
        tags                          = {}
        # (8 unchanged attributes hidden)

      ~ template {
            # (2 unchanged attributes hidden)

          ~ container {
              ~ image             = "ghcr.io/logotter/ingress:0.1.77" -> "ghcr.io/logotter/ingress:"
                name              = "hub"
                # (5 unchanged attributes hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_container_app_custom_domain.admin will be created
  + resource "azurerm_container_app_custom_domain" "admin" {
      + certificate_binding_type                 = "SniEnabled"
      + container_app_environment_certificate_id = (known after apply)
      + container_app_id                         = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/ingress"
      + id                                       = (known after apply)
      + name                                     = "admin.sample.logotter.co.uk."
    }

  # azurerm_container_app_custom_domain.api will be created
  + resource "azurerm_container_app_custom_domain" "api" {
      + certificate_binding_type                 = "SniEnabled"
      + container_app_environment_certificate_id = (known after apply)
      + container_app_id                         = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/ingress"
      + id                                       = (known after apply)
      + name                                     = "api.sample.logotter.co.uk."
    }

  # azurerm_container_app_custom_domain.root will be created
  + resource "azurerm_container_app_custom_domain" "root" {
      + certificate_binding_type                 = "SniEnabled"
      + container_app_environment_certificate_id = (known after apply)
      + container_app_id                         = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/ingress"
      + id                                       = (known after apply)
      + name                                     = "sample.logotter.co.uk."
    }

  # azurerm_container_app_environment_certificate.container-app-certificate will be created
  + resource "azurerm_container_app_environment_certificate" "container-app-certificate" {
      + certificate_blob_base64      = (sensitive value)
      + certificate_password         = (sensitive value)
      + container_app_environment_id = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/managedEnvironments/log-otter-sample-container-app-environment"
      + expiration_date              = (known after apply)
      + id                           = (known after apply)
      + issue_date                   = (known after apply)
      + issuer                       = (known after apply)
      + name                         = "wildcard-certificate"
      + subject_name                 = (known after apply)
      + thumbprint                   = (known after apply)
    }

Plan: 5 to add, 4 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher:* @AButler
*Last Updated:* `2024-03-10T15:57:07.863Z`